mdhardenburgh/Blinky/Packages/.cache/Keil.STM32WBxx_DFP.1.0.0.pdsc
    <component Cclass="Device" Cgroup="STM32Cube HAL" Csub="EXTI"      Cversion="1.0.0" condition="STM32WB HAL">
      <description>EXTI HAL driver</description>
      <RTE_Components_h>
        #define RTE_DEVICE_HAL_EXTI
      </RTE_Components_h>
      <files>
        <file category="source" name="Drivers/STM32WBxx_HAL_Driver/Src/stm32wbxx_hal_exti.c"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="STM32Cube HAL" Csub="Flash"     Cversion="1.0.0" condition="STM32WB HAL">
      <description>Embedded Flash memory HAL driver</description>
      <RTE_Components_h>
        #define RTE_DEVICE_HAL_FLASH
      </RTE_Components_h>
      <files>
        <file category="source" name="Drivers/STM32WBxx_HAL_Driver/Src/stm32wbxx_hal_flash.c"/>
        <file category="source" name="Drivers/STM32WBxx_HAL_Driver/Src/stm32wbxx_hal_flash_ex.c"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="STM32Cube HAL" Csub="GPIO"      Cversion="1.0.0" condition="STM32WB HAL">
      <description>General-purpose I/O (GPIO) HAL driver</description>
      <RTE_Components_h>
        #define RTE_DEVICE_HAL_GPIO
      </RTE_Components_h>
      <files>
        <file category="source" name="Drivers/STM32WBxx_HAL_Driver/Src/stm32wbxx_hal_gpio.c"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="STM32Cube HAL" Csub="HSEM"      Cversion="1.0.0" condition="STM32WB HAL">
      <description>Hardware semaphore (HSEM) HAL driver</description>
      <RTE_Components_h>
        #define RTE_DEVICE_HAL_HSEM
      </RTE_Components_h>
      <files>
        <file category="source" name="Drivers/STM32WBxx_HAL_Driver/Src/stm32wbxx_hal_hsem.c"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="STM32Cube HAL" Csub="I2C"       Cversion="1.0.0" condition="STM32WB HAL DMA">
      <description>Inter-integrated circuit (I2C) interface HAL driver</description>
      <RTE_Components_h>
        #define RTE_DEVICE_HAL_I2C
      </RTE_Components_h>
      <files>
        <file category="source" name="Drivers/STM32WBxx_HAL_Driver/Src/stm32wbxx_hal_i2c.c"/>
        <file category="source" name="Drivers/STM32WBxx_HAL_Driver/Src/stm32wbxx_hal_i2c_ex.c"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="STM32Cube HAL" Csub="IPCC"      Cversion="1.0.0" condition="STM32WB HAL">
      <description>Interprocessor Communication I/O (IPCC) HAL driver</description>
      <RTE_Components_h>
        #define RTE_DEVICE_HAL_IPCC
      </RTE_Components_h>
      <files>
        <file category="source" name="Drivers/STM32WBxx_HAL_Driver/Src/stm32wbxx_hal_ipcc.c"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="STM32Cube HAL" Csub="IRDA"      Cversion="1.0.0" condition="STM32WB HAL DMA">
      <description>IrDA HAL driver</description>
      <RTE_Components_h>
        #define RTE_DEVICE_HAL_IRDA
      </RTE_Components_h>
      <files>
        <file category="source" name="Drivers/STM32WBxx_HAL_Driver/Src/stm32wbxx_hal_irda.c"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="STM32Cube HAL" Csub="IWDG"      Cversion="1.0.0" condition="STM32WB HAL">
      <description>Independent watchdog (IWDG) HAL driver</description>
      <RTE_Components_h>
        #define RTE_DEVICE_HAL_IWDG
      </RTE_Components_h>
      <files>
        <file category="source" name="Drivers/STM32WBxx_HAL_Driver/Src/stm32wbxx_hal_iwdg.c"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="STM32Cube HAL" Csub="LCD"       Cversion="1.0.0" condition="STM32WB HAL">
      <description>LCD Controller (LCD) HAL driver</description>
      <RTE_Components_h>
        #define RTE_DEVICE_HAL_LCD
      </RTE_Components_h>
      <files>
        <file category="source" name="Drivers/STM32WBxx_HAL_Driver/Src/stm32wbxx_hal_lcd.c"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="STM32Cube HAL" Csub="LPTIM"     Cversion="1.0.0" condition="STM32WB HAL">
      <description>Low-power timer (LPTIM) HAL driver</description>
      <RTE_Components_h>
        #define RTE_DEVICE_HAL_LPTIM
      </RTE_Components_h>
      <files>
        <file category="source" name="Drivers/STM32WBxx_HAL_Driver/Src/stm32wbxx_hal_lptim.c"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="STM32Cube HAL" Csub="PCD"       Cversion="1.0.0" condition="STM32WB HAL">
      <description>USB Peripheral controller (PCD) HAL driver</description>
      <RTE_Components_h>
        #define RTE_DEVICE_HAL_PCD
      </RTE_Components_h>
      <files>
        <file category="source" name="Drivers/STM32WBxx_HAL_Driver/Src/stm32wbxx_hal_pcd.c"/>
        <file category="source" name="Drivers/STM32WBxx_HAL_Driver/Src/stm32wbxx_hal_pcd_ex.c"/>
        <file category="source" name="Drivers/STM32WBxx_HAL_Driver/Src/stm32wbxx_ll_usb.c"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="STM32Cube HAL" Csub="PKA"       Cversion="1.0.0" condition="STM32WB HAL">
      <description>Public key accelerator (PKA) HAL driver</description>
      <RTE_Components_h>
        #define RTE_DEVICE_HAL_PKA
      </RTE_Components_h>
      <files>
        <file category="source" name="Drivers/STM32WBxx_HAL_Driver/Src/stm32wbxx_hal_pka.c"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="STM32Cube HAL" Csub="PWR"       Cversion="1.0.0" condition="STM32WB HAL">
      <description>Power controller (PWR) HAL driver</description>
      <RTE_Components_h>
        #define RTE_DEVICE_HAL_PWR
      </RTE_Components_h>
      <files>
        <file category="source" name="Drivers/STM32WBxx_HAL_Driver/Src/stm32wbxx_hal_pwr.c"/>
        <file category="source" name="Drivers/STM32WBxx_HAL_Driver/Src/stm32wbxx_hal_pwr_ex.c"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="STM32Cube HAL" Csub="QSPI"      Cversion="1.0.0" condition="STM32WB HAL DMA">
      <description>Quad Serial peripheral interface (QSPI) HAL driver</description>
      <RTE_Components_h>
        #define RTE_DEVICE_HAL_QSPI
      </RTE_Components_h>
      <files>
        <file category="source" name="Drivers/STM32WBxx_HAL_Driver/Src/stm32wbxx_hal_qspi.c"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="STM32Cube HAL" Csub="RCC"       Cversion="1.0.0" condition="STM32WB HAL GPIO">
      <description>Reset and clock control (RCC) HAL driver</description>
      <RTE_Components_h>
        #define RTE_DEVICE_HAL_RCC
      </RTE_Components_h>
      <files>
        <file category="source" name="Drivers/STM32WBxx_HAL_Driver/Src/stm32wbxx_hal_rcc.c"/>
        <file category="source" name="Drivers/STM32WBxx_HAL_Driver/Src/stm32wbxx_hal_rcc_ex.c"/>
      </files>
    </component>
